/*
    1. Подключите модуль 'fs'
    2. Создайте поток для чтения файла index.html
    3. Опишите для события data функцию обратного вызова, которая выводит 
       в консоль содержимое файла index.html
    4. Сохраните файл, запустите его в консоли и убедитесь в корректной работе.

    1. Измените вывод в консоль, используя вместо объекта консоль объект process
    2. Сохраните файл, запустите его в консоли и убедитесь в корректной работе кода

    1. Измените код, чтобы вместо "прослушки" события data, содержимое файла 
       отдавалось напрямую через метод потока pipe
    2. Сохраните файл, запустите его в консоли и убедитесь в корректной работе кода 
*/

const fs = require("node:fs")

let stream = fs.createReadStream("./index.html")
stream.pipe(process.stdout)
stream.on("close", () => {
    process.stdout.write("\n")
})
