/*
    1. Подключите модуль 'fs'
    2. Создайте поток для чтения файла index.html
    3. Опишите для события data функцию обратного вызова, которая выводит 
       в консоль содержимое файла index.html
    4. Сохраните файл, запустите его в консоли и убедитесь в корректной работе.

    1. Измените вывод в консоль, используя вместо объекта консоль объект process
    2. Сохраните файл, запустите его в консоли и убедитесь в корректной работе кода
*/

const fs = require("node:fs")

let stream = fs.createReadStream("./index.html")
stream.on("data", (data) => {
    process.stdout.write(data)
})
stream.on("close", () => {
    process.stdout.write("\n")
})
